Repository: IvanIlch/i18n-template
Catalog: src/locale/messages.*.xlf
Languages: ru

# introductionHeader
source: Hello i18n!
ru: Привет i18n!

source: I don't output any element
ru: Я не отображаю никакие элементы

source: Updated {minutes, plural, =0 {just now} =1 {one minute ago} other {{{ minutes }} minutes ago}}
ru: Обновлено {minutes, plural, =0 {только что} =1 {минуту назад} other {{{ minutes }} минут назад}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{INTERPOLATION} minutes ago}}
ru: {VAR_PLURAL, plural, =0 {только что} =1 {минуту назад} other {{INTERPOLATION} минут назад}}

source: The author is {gender, select, male {male} female {female} other {other}}
ru: Автор: {gender, select, male {мужчина} female {женщина} other {другое}}

source: {VAR_SELECT, select, male {male} female {female} other {other}}
ru: {VAR_SELECT, select, male {мужчина} female {женщина} other {другое}}

source: Updated: {minutes, plural, =0 {just now} =1 {one minute ago} other {{{ minutes }} minutes ago by {gender, select, male {male} female {female} other {other}}}}
ru: Обновлено: {minutes, plural, =0 {только что} =1 {минуту назад} other {{{ minutes }} минут назад от {gender, select, male {мужчины} female {женщины} other {другого}}}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{INTERPOLATION} minutes ago by {VAR_SELECT, select, male {male} female {female} other {other}}}}
ru: {VAR_PLURAL, plural, =0 {только что} =1 {минуту назад} other {{INTERPOLATION} минут назад от {VAR_SELECT, select, male {мужчины} female {женщины} other {другого}}}}

source: Show
ru: Показать

source: Hide
ru: Скрыть
